#pragma once

#include <string>

// Коды служебных токенов.
// Это символы, которые не встречаются в числовых выражениях,
// поэтому их можно использовать как «типы» токенов без конфликтов.
const char let = 'L';    // ключевое слово let (объявление переменной)
const char quit = 'Q';   // ключевое слово quit (выход)
const char help = 'H';   // ключевое слово help (помощь, упр. 6)
const char print = ';';  // «напечатать результат» (завершает инструкцию)
const char number = '8'; // числовой литерал
const char name = 'a';   // имя переменной

// Мои модификации
// const char skip = 'S';
const string prompt = "> "; // приглашение к вводу
const string result = "= "; // префикс печатаемого результата
